Тест_ЗУП_31_КОРП/src/Documents/УплатаСтраховыхВзносовВФонды/УплатаСтраховыхВзносовВФонды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УплатаСтраховыхВзносовВФонды</name>
  <registerRecords>AccumulationRegister.РасчетыСФондамиПоСтраховымВзносам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлатежа</name>
    <type>
      <types>EnumRef.ВидыОбязательногоСтрахованияСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатежноеПоручениеНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатежноеПоручениеДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/Documents/УплатаСтраховыхВзносовВФонды/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	УчетСтраховыхВзносов.СформироватьУплатуВзносовВФонд(Движения, Отказ, Организация, ДанныеДляПроведения());
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ПлатежноеПоручениеДата, "Объект.ПлатежноеПоручениеДата", Отказ, НСтр("ru='Дата поручения'"), , , Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру параметров для ограничения регистрации объекта при обмене
// Вызывается ПередЗаписью объекта.
//
// Возвращаемое значение:
//	ОграниченияРегистрации - Структура - Описание см. ОбменДаннымиЗарплатаКадры.ОграниченияРегистрации.
//
Функция ОграниченияРегистрации() Экспорт
	Возврат ОбменДаннымиЗарплатаКадры.ОграниченияРегистрацииПоОрганизации(ЭтотОбъект, Организация);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПроведения()
	
	РасчетыСФондами = Новый ТаблицаЗначений;
	РасчетыСФондами.Колонки.Добавить("Период");
	РасчетыСФондами.Колонки.Добавить("ВидОбязательногоСтрахованияСотрудников");
	РасчетыСФондами.Колонки.Добавить("ЭтоСтраховыеВзносы");
	РасчетыСФондами.Колонки.Добавить("ГодЗадолженностиПоЕСН");
	РасчетыСФондами.Колонки.Добавить("Сумма");
	РасчетыСФондами.Колонки.Добавить("ПлатежноеПоручениеДата");
	РасчетыСФондами.Колонки.Добавить("ПлатежноеПоручениеНомер");

	ДанныеДокумента = РасчетыСФондами.Добавить();
	ДанныеДокумента.Период = Дата;
	ДанныеДокумента.ВидОбязательногоСтрахованияСотрудников = ВидПлатежа;
	ДанныеДокумента.ЭтоСтраховыеВзносы = Истина;
	ДанныеДокумента.Сумма = СуммаПлатежа;
	ДанныеДокумента.ПлатежноеПоручениеДата = ПлатежноеПоручениеДата;
	ДанныеДокумента.ПлатежноеПоручениеНомер = ПлатежноеПоручениеНомер;
	
	Возврат РасчетыСФондами;
	
КонецФункции

#КонецОбласти

#КонецЕсли
